; ----------------------------------------------------------------------
P0          := $00
P1          := $02
; ----------------------------------------------------------------------
.org        $8000
.segment    "CODE"

            sei

            ; MOV word [P0], $2000 - установка курсорного
            ldx #$00
            ldy #$20
            stx <P0
            sty <P0+1

            ldx #<HELLO    ; Младший адрес
            ldy #>HELLO    ; Старший адрес
            jsr PSTR
L1:         jmp L1

; ПРОЦЕДУРА ВЫВОДА НА ЭКРАН СТРИНГОВ длиной не более 255
PSTR:       stx <P1
            sty <P1+1
            ldy #$00
@L0:        lda (P1),y
            beq @L1
            sta (P0),y
            iny
            bne @L0
@L1:        rts         ; LOOONG!!

; ----------------------------------------------------------------------
HELLO:      .asciiz     "Hello, world!"
.segment    "BSS"


