; ----------------------------------------------------------------------
P0          := $00
P1          := $02
; ----------------------------------------------------------------------
.org        $8000
.include    "../macro.asm"
.segment    "CODE"

            sei
            movw    <P0, #($2000+32)
            ldax    #HELLO
            jsr     PSTR
L1:         jmp     L1

; ПРОЦЕДУРА ВЫВОДА НА ЭКРАН СТРИНГОВ длиной не более 255
; ----------------------------------------------------------------------

PSTR:       stax <P1
            ldy #$00
@L0:        lda (P1),y
            beq @L1
            sta (P0),y
            iny
            bne @L0
@L1:        rts         ; LOOONG!!

; ----------------------------------------------------------------------
HELLO:      .asciiz     "Hello, world!"
.segment    "BSS"


